"""
На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
Определите минимальное число монеток, которые нужно перевернуть, 
чтобы все монетки были повернуты вверх одной и той же стороной. 
Выведите минимальное количество монет, которые нужно перевернуть
"""
# count = int(input('Введите количество монет: '))
# side1 = 0
# side2 = 0
# for _ in range(count):
#     side = int(input('Если монета лежит орлом вверх, то введите 0, если — вниз, то 1: '))
#     if side%2 == 0:
#         side1 += 1
#     else:
#         side2 += 1
# if side1>=side2:
#     print(f'наименьшее число монет, которые нужно перевернуть — {side1}')
# else:
#     print(f'наименьшее число монет, которые нужно перевернуть — {side2}')

