"""
На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
Определите минимальное число монеток, которые нужно перевернуть, 
чтобы все монетки были повернуты вверх одной и той же стороной. 
Выведите минимальное количество монет, которые нужно перевернуть
"""
# count = int(input('Введите количество монет: '))
# side1 = 0
# side2 = 0
# for _ in range(count):
#     side = int(input('Если монета лежит орлом вверх, то введите 0, если — вниз, то 1: '))
#     if side%2 == 0:
#         side1 += 1
#     else:
#         side2 += 1
# if side1>=side2:
#     print(f'наименьшее число монет, которые нужно перевернуть — {side1}')
# else:
#     print(f'наименьшее число монет, которые нужно перевернуть — {side2}')

"""
Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
Петя помогает Кате по математике. Он задумывает два натуральных числа 
X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает 
две подсказки. Он называет сумму этих чисел S и их произведение P. 
Помогите Кате отгадать задуманные Петей числа.
"""
# summ = int(input('Введите сумму загаданных вами двух чисел: '))
# mult = int(input('Введите произведение загаданных вами двух чисел: '))
# a = 1
# b = summ-1
# while a+b != sum and a*b != mult:
#     if a <= b:
#         a+=1
#         b-=1
# else:
#     print(f'Вы загадали числа {a} и {b}')

